[
    {
        "defTitleEn": "Computer",
        "defTitleKu": "کۆمپیوتەر",
        "defDetail": "Id6KepXRBQSoB/2e49o5kXt1AsdGmeZnYCGeuOnyuuNbqd8f5MDt6mjqEVKzbH68E+t/+t2NcniowPGDlAipHWFgnl2FhsUiFe8IdIW1tFZCBtl15z0iBOkTBNmGJkMDPe8FtMdokuhORuPy9rgpYt6p0kM23bVe8pLV0T779Mpq2rtUalk2AX+ePLReINu8OubQwS8xWEGBGEHE+kj+QGmDXZ0ob9HPf4/BL+Qg97en28R/Ie9wD1k8xate7DZxOM+LFcSZHAM/0NfIUo2QJ5lsT3P/y2qOgKRizwZGumxcGqzWO+kUbZuWQttOgS8eAQf9pN0L7iYOR/fuFul6abb4UZgq+plmJH583sTqvo29caxPcZ0K0PEsmNUkezCcGYNaTTusSB9YAYQpjoECrm5Qrc3zd3GxFVDTN+ZVt4uRwYsbFBaixXzbI1jEm80aYz46pOMqPKeiDyLGYv6mqXvWnE6OOt1o+raR4A917X5TlhvQJ6BSj/fsWwi8peuhoIa6rpXm/gxxznr3AulX9KeNdkHnefx/cuP2bTmywBeoeOby7KboBooMVyyN3Y9cEV9TKVm0JvNbTZQ090S01CHAjfiL7Jj5nK2c35au9YzJfJPWsOlWAT0OMQJc1r6PnJVHFgwye+CiluNM34Gq1ip4Br5S7+5O6OwxXdgGJzZWL8nU88GJMEncnjtBHiUrvupYxpTfwUQJlUNnXfVWoNDUCqrpWco0JDe4boh5FeYZvsS1lpdZlBMdxPblR5UIRd0kIHeNc8BlLlcG9EhRtjuwpsMJUEtU/QhbCVJ6scL8Xn4JLpgFuTsDtH4oJ+WtEi7sID++LkiLnBsz5K7bA0VhrxlNJr/sET7bvigg/4qUH3mMstJ+PhN42V55DFizKKNPwIDhwTMfQUeF7QfYWo8pcyeM30ELDZJEWoPIM/HUw2Z/ppgSvJjywEMCRp3meeSj0yqZ+mZLaovBFNIy86R76KDDHVd+WEb82CTIUWyVk5Usj6V1RkCBGtJyGlUl6t5knQ4OsNVWsXa9jT3pq9/3efrasasILqazrwKWJ80qFmjh3bv5WNabqBXFXoaaWQo5ZbmNSIOH9HWoqYHobCMW5ZdZ4GQYtyhSX7fsDHHkzup4+vFdVy37Su0ja+vss0CuKqIExa3GtzXrn8RAQzctSDL9X+PrsBF+haaoiPXNnGLhYgSS0q8DfmA13XD4VFbgJUe4n+nUJUt2SzHjmMSDDe7kmPfbA4TD9z4jFV5qIk833e0G08wWQLz/QARJuE4Kb2HBdEs5UEA7lEIanWhqJy/mbzMeV2PX+4aMzV7TNPmMtnwv9TocqI4CQ2nnC7BUvgoq7SQAeqJkfe/OE8wnjy/uKFag+CzcsQVIPXhI9r1uElzryxQ6marvhyz71Uk7onYGVGLV7Q/hr4irvSjYceCmWs08OogTQtbpjeCIu8sJzVi6TOI76hXuikw7ssmUG5f4s8yTQ/HAshB5DRgHXmn86QodTWIILcAuMQQngb4tKPA1fxhg04GMYSBDlhiOAMcJ4+ppa63eCUjD8g=="
    },
    {
        "defTitleEn": "Compile",
        "defTitleKu": "کۆمپایڵ",
        "defDetail": "<p>بەرنامەسازان (ئینگلیزی: Programmers) بە زمانی بەرنامەسازی (ئینگلیزی: Programming Language) کار دەکەن تاکو بەرنامە بسازێنن، لەڕێی ئەو زمانانەوە کۆدەکانیان لەنێو فایل یان چەند فایلێکدا دەنووسنەوە بە ناوی “سەرچاوەی کۆد” (ئینگلیزی: Source Code). ئەم فایلانە دەقییانە بەشێوەیەکی خوێندراو دەنووسرێنەوە، واتە مرۆڤ دەتوانێت بیخوێنێتەوە — بەپێچەوانەی زمانێکی وەک دوویی (ئینگلیزی: Binary) — و بەرنامەسازان دەتوانن دەستکارییان بکەن.</p><p>ئەو فایلانە ڕاستەوخۆ لەلایەن کۆمپیوتەرەوە هەڵناهێنرێن، چونکە زمانێکی ئاستبەرز (ئینگلیزی: High-level language) نووسراون بەڵکو سەرەتا دەگۆڕدرێن بۆ زمانی مەکینە (ئینگلیزی: Machine Language) تاکو کۆمپیوتەرەکە لێی تێنگات. ئەم گۆڕینە پێی دەگوترێت “کۆمپایڵکردنی کۆد”.</p><p>زۆربەی ئەو بەرنامانەی کە بەرنامەیان پێ دروست دەکرێت — وەک (Android Studio) — کۆمپایڵەرێکیان تێدایە کە کۆمپایڵی کۆدەکان دەکات؛ لەدوای کۆمپایڵبوون، کۆمپیوتەرەکە دەتوانێت وەک بەرنامەیەکی سەربەخۆ لێی بڕوانێت و بەشێوەی فایلی “EXE” دەخرێتە ڕوو — ئەوە لە ویندۆزدا —، لە ماکیشدا پێشگری ناوی بەرنامەکان بریتییە لە “APP”، لە سیستەمەکانی دیکەیشدا دەگۆڕێت.</p>"
    },
    {
        "defTitleEn": "Array",
        "defTitleKu": "ڕیزەک",
        "defDetail": "<p>ڕیزەک پێکهاتەیەکی داتایە کە کۆمەڵێک دانەی لەخۆ گرتووە. هەموو ئەو دانانە هەمان جۆری داتان، وەک زنجیرەنووسە یان ژمارەی تەواوەتی. ڕیزەک بەگشتی بۆ لەپاڵخستنی کۆمەڵێک داتای هاوجۆر بەکار دەهێنرێت تاکو بەئاسانی بدۆزرێنەوە یان لە بچووکەوە بۆ گەورە — و بەپێچەوانەیشەوە — ڕیز بکرێن.</p><p>مەکینەیەکی گەڕان (ئینگلیزی: Search Engine) لە تۆڕگەڕێکدا ڕەنگە ڕەنگە ڕیزەکێک بەکار بهێنێت کە بەستەر و ناونیشانی ئەو تۆڕگانەی لەخۆ گرتووە کە بەکارهێنەکە بۆی گەڕاوە.</p><p>شێوەنووسینی ڕیزەکەکان بەگشتی لەم شێوەیەدان:</p><code>arrayName[0] = \"Slaw! \"; <br> arrayName[1] = \"Serchawm \";<br> arrayName[2] = \"hatit.\";<br><br>print arrayName[0];<br>print arrayName[1];<br>print arrayName[2];</code><p>ئەم کۆدەی سەرەوە نرخی هەرسێ ڕیزەکەکە دەخاتە ڕوو کە دەبێتە “Slaw! Serchawm hatit.”. </p>"
    },
    {
        "defTitleEn": "Apple",
        "defTitleKu": "ئەپڵ",
        "defDetail": "<p>ئەپڵ (ئینگلیزی: Apple) بەشکۆیەکی تەکنەلۆجیایییە کە لە ساڵی (١٩٧٦)ز لەلایەن “ستیڤ جۆبس” (ئینگلیزی: Steve Jobs) و “ستیڤ وۆزیاک” (ئینگلیزی: Steve Wozniak) و “ڕۆناڵد وەین” (ئینگلیزی: Ronald Wayne) دامەزرا. بەشکۆیەکە کۆمپیوتەری ماکینتۆشی دروست دەکات، وەک: ئایماک، ماک مینی، ماکبووک، ماکبووک‌پڕۆ، ماک‌پڕۆ. هەروەها چەندان ئامێری ئەلیکیرۆنیی کەسیی بەرهەم دەهێنێت، وەک: ئایفۆن، ئایپاد، ئایپۆد، ئەپڵ‌وۆچ.</p><p>بەدەر لەوانە، ئەپڵ خاوەنی چەند نەرمەواڵایەکی نێوخۆیییشە بۆ ئەو ئامێرانەی کە بەرهەمیان دەهێنێت، وەک: ئەپەکانی ئای‌وۆرک — (ئینگلیزی: iWork Apps) — (وەک: پەیجس، نەمبەرس، کینۆت)، ماک‌ئۆئێس (ئینگلیزی: macOS)، ئای‌ئۆئێس (ئینگلیزی: iOS).</p><p>لەگەڵ چەندان خزمەتگوزاریی دیکە، تەنیا ناوی یەکێکیان دەهێنم کە لە کوردستاندا پێویستە و خەڵک هەیە بەکاری بهێنێت، ئەویش “ئایکلاود” (ئینگلیزی: iCloud)ـە.</p><p>لە ساڵی (٢٠٠٧)دا بوو کە بەشکۆیەکە ناوەکەی خۆی لە “Apple Computer”ـەوە بۆ “Apple” گۆڕی، ئەوەیش کاریگەریی زیاتری خستە سەر بڵاوکردنەوەی بەرهەمەکانی؛ چونکە بەدڵنیاییەوە ناوی کورت و جوان کاریگەریی خۆی هەیە.</p>"
    },
    {
        "defTitleEn": "Application",
        "defTitleKu": "ئەپلیکەیشن",
        "defDetail": "<p>وشەی “ئەپلیکەیشن” کوردیش بەکاری دەهێنێت، هەرچەندە کەمەجیاوازییەکی لەگەڵ “بەرنامە” (ئینگلیزی: Program)دا هەیە؛ وشەکە لە ئینگلیزیدا، لە کوردییشدا، جاروبار بۆ “ئەپ” (ئینگلیزی: App) کورت دەکرێتەوە.</p><p>چەمکەکە لەلایەن بەشکۆی ئەپڵەوە لە ساڵی (٢٠٠٨)دا ناودار کرا کاتێک “ئەپ‌ستۆر”ـی دروست کرد، واتە ساڵێک لەدوای بڵاوکردنەوەی یەکەم جۆری ئایفۆن.</p><p>ئێستا چەمکەکە بەگشتی بۆ بەرنامەی مۆبایل و تابلێت بەکار دەهێنرێت، هەروەها بەرنامەکانی ماکیش، بەڵام بەرنامەکانی کۆمپیوتەر هەر بە “ئەپلیکەیشنی دێسکتۆپ” (ئینگلیزی: Desktop Applications) ناسراون؛ لە کوردستاندا هەر بە “بەرنامەی کۆمپیوتەر” یان “سۆفتوێر” ناسراون.</p><p>ئەپلیکەیشنەکانی هەردوو سیستەمی “ئەندرۆید” و “ئای‌ئۆئێس” لە بازاڕێکی سەرهێڵییەوە دادەبەزێنرێن؛ تێیاندایە کە بەپارەیە و تێیاندایە کە بەخۆڕایییە. ئەپی پارەییی مۆبایل بەگشتی هەرزانترە لەچاو ئەپی پارەییی کۆمپیوتەر، چونکە بەگشتی ئاسانترن و کاتی کەمتریان پێویستە بۆ دروستکردن لەچاو ئەپی کۆمپیوتەر.</p>"
    },
    {
        "defTitleEn": "Antivirus",
        "defTitleKu": "دژەڤایرۆس",
        "defDetail": "<p>دژەڤایرۆس بریتییە لەو نەرمەواڵا سوودبەخشە کە بۆ پشکنین و لابردنی ڤایرۆسی نێو کۆمپیوتەر بەکار دەهێنرێت تاکو لە زیان پارێزراو بێت؛ جا هەر جۆرە ڤایرۆسێک بێت، بەربڵاوترینیان لە کوردستاندا ئەو جۆرەیە کە لەڕێی دابەزاندنی فایلێکی ئینتەرنێتەوە دێتە نێو کۆمپیوتەر.</p>"
    },
    {
        "defTitleEn": "Android",
        "defTitleKu": "ئەندرۆید",
        "defDetail": "<p>ئەندرۆید بریتییە لە سیستەمی وەگەڕخەری مۆبایل کە لەلایەن بەشکۆی گووگڵەوە گەشەی پێ دراوە و لەلایەن چەندان مۆبایلی زیرەک و تابلێتەوە بەکار دەهێنرێت وەک: سامسۆنگ گالاکسی، هواوی، سۆنی ئێکسپیریا…هتد.</p><p>بەپێچەوانەی “ئای‌ئۆئێس”ـەوە، ئەندرۆید کۆدکراوەیە، واتە گەشەپێدەران دەتوانن بۆ هەر مۆبایلێک سیستەمەکە دەستکاری بکەن بەو شێوەیەی کە خۆیان دەیانەوێت؛ لەبەر ئەمەیە کە چەندان بەشکۆی هەمەجۆر سیستەمەکە بەکار دەهێنن و هەریەکەو نێوبەستی بەکارهێنی جیاوازیان هەیە.</p><p>بەرنامەکانی ئەندرۆید بەگشتی بە زمانی “جاڤا” دەنووسرێن.</p><p>واتای وشەکان:<ul class=\"watayWshaList\"><li>ئەندرۆید: Android</li> <li>بەشکۆ: Company</li> <li>ئای‌ئۆئێس: iOS</li> <li>جاڤا: <a href=\"Java\">Java</a></li></ul></p>"
    },
    {
        "defTitleEn": "Website",
        "defTitleKu": "تۆڕگە",
        "defDetail": "<p>دوو شت هەن کە جاروبار لەجێی یەکتر بەکار دەهێنرێن، ئەوانیش بریتین لە “وێبسایت” و “وێبپەیج”. وشەی “وێبسایت” بە کوردی دەبێتە “تۆڕگە”، چونکە وشەکە لە “Web” و “Site” — بە واتای “شوێن” — پێکهاتووە، وشەی “وێبپەیج”ـیش دەبێتە “لاپەڕەتۆڕ”. تۆڕگە لە لاپەڕەتۆڕێک یان زیاتر پێکهاتووە، ئیدی ئەو زیاترە دەکرێت ملیۆنان لاپەڕەتۆڕ بگرێتەوە، وەک تۆڕگەی فەیسبووک کە لە بلیۆنان لاپەڕەتۆڕی هەمەجۆر پێکهاتووە، زیاتریش.</p><p><ul class=\"watayWshaList\"><li>وێب: <a href=\"Web\">Web</a></li><li>لاپەڕەتۆڕ: <a href=\"Webpage\">Webpage</a></li><li>فەیسبووک: <a href=\"Facebook\">Facebook</a></li></ul></p>"
    },
    {
        "defTitleEn": "Webpage",
        "defTitleKu": "لاپەڕەتۆڕ",
        "defDetail": "<p>لاپەڕەتۆڕ بریتییە لە لاپەڕەیەکی تۆڕگەیەک کە لە دروستکردنیدا دەکرێت چەند زمانێک بەشدار بن، زمانە سەرەکییەکەیان بریتییە لە “هتمڵ”. لاپەڕەتۆڕ دەکرێت دەق و وێنە و ڤیدیۆ و فۆڕم لەخۆ بگرێت، بەستەریش، کە بەکارهێن بەرەو لاپەڕەتۆڕ یان تۆڕگەیەکی دیکە دەکات. لاپەڕەتۆڕەکان تۆڕگەکانیان پێکهێناوە؛ پێکەوە بەستراون.</p><img src=\"https://mysiteauditor.com/blog/wp-content/uploads/2014/05/web-pages-versus-websites.png\" alt=\"جیاوازیی نێوان وێبسایت و وێبپەیج\"><p>وشەکان: <ul class=\"watayWshaList\"><li>تۆڕگە: <a href=\"Website\">Website</a></li><li>هتمڵ: <a href=\"HTML\">HTML</a></li><li>دەق: <a href=\"Text\">Text</a></li><li>وێنە: <a href=\"Image\">Image</a></li><li>ڤیدیۆ: <a href=\"Video\">Video</a></li><li>فۆڕم: <a href=\"Form\">Form</a></li><li>بەستەر: <a href=\"Link\">Link</a></li></ul></p>"
    },
    {
        "defTitleEn": "Kurdistan 5",
        "defTitleKu": "کوردستان",
        "defDetail": "..."
    },
]
